// config.js
export const TAG_CONFIG = {
    "物品存储科技": {
        "全物品单片": ["8_chests", "10_chests", "12_chests"],
        "大宗仓库": ["盒分大宗", "分类打包大宗", "四边形大宗(quad)"],
        "多物品/不可堆叠": ["多物品分类(MIS)", "多种类潜影盒分类(MBS)", "不可堆叠分离", "不可堆叠分类", "无实体输入(SIS)"],
        "仓库成品/其他": ["仓库成品(ms)", "空盒仓库", "堆分离/分类"]
    },
    "潜影盒处理": {
        "打包机(box_loader)": ["可访问", "分类", "缓存", "混杂", "精密", "自适应", "比例打包", "堆分打包", "计数打包"],
        "拆包机(box_unloader)": ["标准拆包", "矿车拆包(yeeter)"],
        "展示/合并(box_display+)": ["无残留", "常用展示", "自出盒", "可反悔", "合并器", "不满盒存储", "分组器", "配对器"],
        "进阶处理": ["分盒器", "填充度分类(SS-sorter)", "分流器/黑白名单", "自适应分类(SVAR)", "车头及拐弯设计"]
    },
    "编码科技": {
        "编码存储": ["编码全物品单片", "编码大宗", "矩阵(matrix)", "远程大宗", "动态大宗"],
        "逻辑/传输": ["逻辑电路", "移位寄存器", "转码器", "潜影盒硬盘"],
        "解码器(decoder)": ["方块事件深度(BED)", "二进制", "十进制", "十六进制", "强模(HSS/OSS)", "高速(10 BPS)"],
        "组件": ["编码器", "其他组件"]
    },
    "生产/合成": ["合成器相关(crafter+)", "比例打包", "计数打包"],
    "版本": ["1.21.x", "1.20.x", "1.19+", "1.19-"],
};

export const CATEGORIES = Object.keys(TAG_CONFIG);